test_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (-1 -1 -1.0)
    (1 -1 -1.0)
    (1 1 -1.0)
    (-1 1 -1.0)
    (-1 -1 41.0)
    (1 -1 41.0)
    (1 1 41.0)
    (-1 1 41.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (5 5 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (6 2 3 7)
        );
    }
    fixedWalls
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (1 2 5 6)
            (4 0 1 5)
        );
    }
    frontAndBack
    {
        type patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
